---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.GuidEnum
source: html/ff74fdbe-0f05-4cb1-822d-7fd208fde4f6.htm
---
# GuidEnum Members

Creates an Guid-based enum instance with the supplied name and GUID.
GUID-based enum instance can be compared by this guid value.